## csp_violation_report_service
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 10 to add, 1 to change, 10 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.trigger_api_lambda_to_purge_stale_reports will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "trigger_api_lambda_to_purge_stale_reports" {
      ~ arn            = "arn:aws:lambda:ca-central-1:794722365809:function:purge_csp_reports" -> (known after apply)
        id             = "purge-stale-csp-reports-csp-violation-report-service-security-tools-csp-violation-report-service-purge-stale"
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_call_lambda" {
      ~ function_name = "purge_csp_reports" -> "purge_stale_reports" # forces replacement
      ~ id            = "AllowExecutionFromCloudWatch" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.purge_csp_reports_lambda.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:ca-central-1:794722365809:log-group:/aws/lambda/purge_csp_reports" -> (known after apply)
      ~ id                = "/aws/lambda/purge_csp_reports" -> (known after apply)
      ~ name              = "/aws/lambda/purge_csp_reports" -> "/aws/lambda/purge_stale_reports" # forces replacement
        tags              = {
            "CostCentre" = "security-tools-794722365809"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)
    }

  # module.purge_csp_reports_lambda.aws_iam_policy.policies[0] must be replaced
-/+ resource "aws_iam_policy" "policies" {
      ~ arn       = "arn:aws:iam::794722365809:policy/purge_csp_reports-0" -> (known after apply)
      ~ id        = "arn:aws:iam::794722365809:policy/purge_csp_reports-0" -> (known after apply)
      ~ name      = "purge_csp_reports-0" -> "purge_stale_reports-0" # forces replacement
      ~ policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:CreateLogStream",
                            "logs:CreateLogGroup",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:ca-central-1:794722365809:log-group:*"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "ssm:GetParameters",
                            "ssm:GetParameter",
                            "ssm:DescribeParameters",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/csp_reports/db_username",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/csp_reports/db_password",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/csp_reports/db_host",
                            "arn:aws:ssm:ca-central-1:794722365809:parameter/csp_reports/db_database",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id = "ANPA3SCJE6FY6ZJVJWMHP" -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)
    }

  # module.purge_csp_reports_lambda.aws_iam_policy.vpc_policies[0] must be replaced
-/+ resource "aws_iam_policy" "vpc_policies" {
      ~ arn       = "arn:aws:iam::794722365809:policy/purge_csp_reports_vpc" -> (known after apply)
      ~ id        = "arn:aws:iam::794722365809:policy/purge_csp_reports_vpc" -> (known after apply)
      ~ name      = "purge_csp_reports_vpc" -> "purge_stale_reports_vpc" # forces replacement
      ~ policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = [
                            "ecr:GetDownloadUrlForlayer",
                            "ecr:BatchGetImage",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:ecr:ca-central-1:794722365809:repository/security-tools/csp_violation_report_service/purge_stale_reports"
                        Sid      = "ECRImageAccess"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id = "ANPA3SCJE6FYVIKKKQWUQ" -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)
    }

  # module.purge_csp_reports_lambda.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::794722365809:role/purge_csp_reports" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-07-31T02:49:40Z" -> (known after apply)
      ~ id                    = "purge_csp_reports" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::794722365809:policy/purge_csp_reports-0",
          - "arn:aws:iam::794722365809:policy/purge_csp_reports_vpc",
          - "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole",
        ] -> (known after apply)
      ~ name                  = "purge_csp_reports" -> "purge_stale_reports" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "CostCentre" = "security-tools-794722365809"
            "Terraform"  = "true"
        }
      ~ unique_id             = "AROA3SCJE6FYRNF3LO35S" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.purge_csp_reports_lambda.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      ~ id         = "purge_csp_reports-20220731024940955300000002" -> (known after apply)
      ~ role       = "purge_csp_reports" -> "purge_stale_reports" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.purge_csp_reports_lambda.aws_iam_role_policy_attachment.attachments[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attachments" {
      ~ id         = "purge_csp_reports-20220731025202602500000004" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::794722365809:policy/purge_csp_reports-0" -> (known after apply) # forces replacement
      ~ role       = "purge_csp_reports" -> "purge_stale_reports" # forces replacement
    }

  # module.purge_csp_reports_lambda.aws_iam_role_policy_attachment.lambda_insights[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_insights" {
      ~ id         = "purge_csp_reports-20220731024940963900000003" -> (known after apply)
      ~ role       = "purge_csp_reports" -> "purge_stale_reports" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.purge_csp_reports_lambda.aws_iam_role_policy_attachment.vpc_policies[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "vpc_policies" {
      ~ id         = "purge_csp_reports-20220731024940945500000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::794722365809:policy/purge_csp_reports_vpc" -> (known after apply) # forces replacement
      ~ role       = "purge_csp_reports" -> "purge_stale_reports" # forces replacement
    }

  # module.purge_csp_reports_lambda.aws_lambda_function.this must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ architectures                  = [] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:794722365809:function:purge_csp_reports" -> (known after apply)
      ~ function_name                  = "purge_csp_reports" -> "purge_stale_reports" # forces replacement
      ~ id                             = "purge_csp_reports" -> (known after apply)
      ~ image_uri                      = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/csp_violation_report_service/purge_stale_reports@sha256:4ff64c474fad8768a4f5924b702624c0082c72e93963d534d60a02571f8581a4" -> "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/csp_violation_report_service/purge_stale_reports:latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:794722365809:function:purge_csp_reports/invocations" -> (known after apply)
      ~ last_modified                  = "2022-08-04T19:40:10.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:794722365809:function:purge_csp_reports:$LATEST" -> (known after apply)
      ~ role                           = "arn:aws:iam::794722365809:role/purge_csp_reports" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "4ff64c474fad8768a4f5924b702624c0082c72e93963d534d60a02571f8581a4" -> (known after apply)
      ~ source_code_size               = 0 -> (known after apply)
        tags                           = {
            "CostCentre" = "security-tools-794722365809"
            "Terraform"  = "true"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (6 unchanged attributes hidden)



      ~ vpc_config {
          ~ vpc_id             = "vpc-09e67df406a1a998f" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 10 to add, 1 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.csp_reports"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
